<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"1eff2d133f664a88f40915ac0881b2b52abaf8b0edab61afc8cb48ce4787dd87","plan_job_ref":"Job Test actions using target and replace #468 at https://github.com/dflook/terraform-github-actions/actions/runs/14018638206","plan_out_hash":"aa03e06b748a2ee2c907c13f4289f21938ed818a5e47ecd6d28c8b0c5ad31b86","plan_hash":"b446c91b817088c5346b5b48c1637db1f647d6c576f6da090d7456e6e2a80133","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "v3l5rbqseZ" -> (known after apply)
!~  foreach = "UhmbLypnZ7" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #468](https://github.com/dflook/terraform-github-actions/actions/runs/14018638206)